// 💡 data.js 更新後的內容
const articleData = [
  {
    id: 1,
    title: "五日節",
    paragraphs: [
      "一下到五日節，「未食五日節粽，破裘毋甘放」這句俗語，四界攏聽會著，若像隨時會鼻著人咧煠肉粽的芳味。這句俗語，勸人天氣多變化，五日節過才算熱天，甘願予衫做奴才，毋通欲穿揣無路來。",
      "我逐冬食著頭粒五日節粽，毋是想著破裘愛放毋放，我是「未食五日節粽，毋知鄉愁遐爾重」。五日節的一禮拜前，阮二姊用這馬足利便的『宅急便』，寄一捾家己縛的肉粽分我食。一下接著，我就隨提一粒退冰，用電鍋炊來食。下港的粽一下窒入喙，隨少年三十幾歲，若像轉去國中那耍水那洗粽箬的日子，熱天有彼款足涼的工課，有夠讚。",
      "粽箬仝款是我來洗，免技術愛有耐心的工課，毋過，彼擺我有縛著誠濟肉粽，會曉縛粽，表示已經大漢。大姊款的料比阿媽較豐沛，伊毋知去佗位學來的，毋但秫米愛用油蔥仔酥炒過；蝦米、香菇、半精肥的豬肉、鰇魚，用紅蔥仔頭芡芳了，閣濫中藥房拆轉來的 五香炒甲芳貢貢、貢貢芳；閣有塗豆、規粒的鹹卵仁佮規粒的栗子。縛家己食好，若欲賣會算袂和。那縛著那煠粽，一鼎愛煠點半鐘。",
      "這就是正港用煠的好料下港粽。二姊寄來的就是這味， 佮北部用粽箬包油飯炊的無仝。 食著下港粽，才知影阮姊妹仔的感情縛比粽較絚，一直捾規摠， 才知我思念故鄉的心情遐爾重。",
    ],
  },
];

// 加上 \n \r 確保換行字元不會被誤算成要描寫的生字
const ignoreRegex = /[、；，。「」1a-zA-Z\n\r]/;
